/*
// Задача 2 Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
Console.WriteLine("Input first number:");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number:");
int b = Convert.ToInt32(Console.ReadLine());
if (a>b)
  Console.WriteLine($"{0} is max number {a}");
  else
  Console.WriteLine($"{0} is max number {b}");
*/

